# Вывести на экран последовательно несколько слов, по одному слову на каждой строке экрана: "Улыбок", "тебе", "дед", "Мокар"


print("Улыбок")
print("тебе")
print("дед")
print("Мокар")