# Написать числовые выражения (без участия переменных), результат вычисления которых будет равен 4. Предложить 5 вариантов.

print((5 + 6) - 7)
print((8 * 2) / 4)
print(2 ** 2 + 2)
print((10 - 6) // 1)
print((16 // 4) - 1)