-- Вывести на экран фразу "Тарту дорог как город утрат" таким образом, чтобы каждое слово было
--на отдельной строке. Предложить 5 вариантов решения.


print("Тарту\nдорог\nкак\nгород\nутрат")

print("___________________________")

print("Тарту")
print("дорог")
print("как")
print("город")
print("утрат")

print("___________________________")

local a =  "Тарту\nдорог\nкак\nгород\nутрат"
print(a)

print("___________________________")

local b = "Тарту"
local c = "дорог"
local d = "как"
local e = "город"
local f = "утрат"

print(b)
print(c)
print(d)
print(e)
print(f)


local z = [[Тарту 
дорог 
как 
город 
утрат]]

print(z)
print("___________________________")


print([[Тарту 
дорог 
как 
город 
утрат]])

