--Что выведет в консоль следующая программа? Описать, как выглядит этот вывод, какие символы
--присутствуют

local a = 10
local b = 15
print("a + b = ", a + b)

-- Данная программа выведет в консоль a + b =         25
-- Функция print() сначала выводит строку а + b =, а потом сумму выражений a и b
-- Функция print() сначала выводит строку а + b =, а потом значение выражения a + b 

-- функция print() выводи все аргументы через табуляцию

local d -- оператор объявления локальной переменной
d = 10 -- оператор присвоения значения переменной
local f = 5 -- оператор объявдение локальной переменной с присвоением значения