-- Что выведет в консоль следующая программа?

local a = "First string"
local b = " and second string"
print("a .. b = " .. a .. b)

-- Данная программа выведет в консоль a .. b = First string and second string
-- Функция print() сначала выводит строку a .. b =, а потом обращается к переменным a и b выведет их значения

-- Функция print() сначала выводит строку a .. b =, а потом сумму выражений a и b
-- Функция print() сначала выводит строку a .. b =, а потом значение выражения a .. b 


--Функция принт выводит значение выражения "a .. b = " .. a .. b