-- Что является выражением, а что является оператором? В случае оператора указать, что именно
--за оператор и провести синтаксический разбор. В случае, если это выражение, указать его тип.

--1
--a * b - c
--Выражение типа number

--2
--a > b
-- Выражение типа boolean

--3
--local a
-- Оператор объявления локальной переменной а

--4
--local b = a + 1
-- Оператор объявления локальной переменной b, в которую записывается выражение типа number

--5
--a = a + 1 - b
-- Оператор присвоение переменной a значаения выражения a + 1 - b





