-- Описать последовательность действий компьютера/интерпретатора при выполнении оператора
-- local a = 1 + 10

--? Интерпритатор  выполняет написанный код
--1 Компьютер инициализирует в памяти ячейку под названием а
--1.1 Компьютер вычисляет  значение выражения 1 + 10
--2 Компьютер записывает (сохраняет) в эту локальную переменную a (ячейку памяти) значение выражения 1 + 10



--Выражение - форма записи в котором участвуют переменные, другие выражения. Запись вычисления


local a = 1
a = a + 1

--1 Компьютер инициализирует ячейку памяти a
--2 Компьютер записывает в эту ячейку памяти значение 1
--3 Компьютер вычисляет выражение а + 1 (2)
--4 Компьютер записывает значение выражение а + 1 в переменную а (2)


-- оператор целостная конструкция а = 1 не значит последовательность действий