-- Описать последовательность действий компьютера/интерпретатора при выполнении операторов
--следующей программы:
local a = 10
local b
b = a - 10
print(b + 20)

--1 Компьютер инициализирует в памяти ячейку под названием а
--2 Компьютер записывает в локальную переменную а значение 10
-- 2.5 Компьютер инициализирует пустую переменную b
--3 Компьютер вычисляет выражение а - 10 (0)
--4 Компьютер записывает результат вычисления выражения а - 10 в переменную b
-- 5 Компьютер вычисляет значение вырадения b + 20 (20)
-- 6 Компьютер вызывает функцию print() со значением 20




--- Порешать такой же разбор из других задач