--[[

КОНТРОЛЬНЫЕ ВОПРОСЫ




1. nil, number, string, userdata, table, boolean, function
В числах с плавающей точкой есть разделитель, точность чисел с плавающей точкой есть только до 10 или 14-го знака

2.Русские буквы в Tarantool использовать нельзя. Можно задавать имена переменной как с большой, так и с маленькой букувы.
В camelCase или использовать нижнее подчеркивание

3.Нельзя использовать зарезервированные слова and if и т.д.

4. Учитывается

5.БЛОК кода - несколько операторов которые идут последовательно 

6. the и end разделители, которые используются в БЛОКЕ

7. Нужно написать такое выражение, в котором сумма двух чисел равна числу с которым мы сравниваем, а ложь наоборот 

8.Литералы фиксированные данные в программном коде. (??)
Любые литералы

9. Строки сравнивать между собой можно. Можно получить длину строки с помощью # 
Или string.find чтобы найти похожую строку 


10. Команда выполнится, но лучше написать 
local  a = 1; print(a)

11. Нет, нужно убрать "+"  код не бует запускаться

12. Нет, код работать не будет 

13. Нужно создать 3-ю переменную, в которю будет записона сумма a и b 

14. Можно написать local a = a + a или +1


]]

